1) 내가 현재쓰는 database 확인
 - select DATABASE()
 
 2) select DATABASE() FROM dual; 
 - select 12*20 FROM dual;, select 12*20; (사실상 결과값은 같음)
 
 3) 테이블을 생성할떄...select를 활용하여 다른 테이블의 칼럼 데이터를 함께 가져옴
 - create table usertbl3 (age Int PRIMARY KEY DEFAULT 10, gender char(1) DEFAULT "중")\
   select name as "이름" , addr from usertbl;

 ## INSERT문
 
 1) AUTO_INCREMENT
  - create table testtbl2 (id int AUTO_INCREMENT PRIMARY KEY, username char(3), age int);\
    insert into testtbl2 values (null, "노라", 25);\
    insert into testtbl2 values (null,"유나", 22);\
    insert into testtbl2 values (null, "유경",21);

    select * from testtbl2
    
  2) 대량의 샘플 데이터 생성(insert into --selecet문)
  - create table testtbl4(id int, Fname varchar(50), Lname VARCHAR(50));\
    insert into testtbl4
	select emp_no, first_name, last_name from employees.employees; 
    
   3) create table--select를 활용하여 테이블 생성과 동시에 바로 사용 가능
  - create table testtbl5\
    select emp_no, first_name, last_name from employees.employees;
    
 ## 조건부 INSERT문
 
  1) 먼저 테이블을 select문을 활요하여 만듦
   - create table membertbl\
         select userid, name, addr from usertbl limit 3;
         
  2) userid를 기본키로 설정함
   - ALTER table membertbl\
        ADD CONSTRAINT pk_membertbl PRIMARY KEY (userid);
        ADD PRIMARY KEY (userid);
        
  3) 기본키가 중복되면..데이터가 수정되도록 함
  - insert into membertbl values("BBK", "비비코","미국")\
    On DUPLICATE KEY UPDATE name="비비코", addr="미국";

 ## UPDATE문
 
 1) 기본 구문
  - UPDATE testtbl4 set Lname="없음" where Fname="kyoichi";
  
 2) where을 생략하여 전체 열을 모두 변경함
  - select * from buytbl;
  - update buytbl set price = price*1.5;

 ## DELETE문
 
  1) 기본구문
  - delete from testtbl4 where fname="Aamer";
  
  2) where절을 사용하여 특정부분만을 삭제해야함 !
  
  3) 대용량 테이블 삭제하기
  - DELETE FROM table :오래 걸림
  - DROP TABLE : 테이블 자체를 삭제함
  - TRUNCATE TABLE : 테이블은 존재함 (빠름)

## with문

1) 각 지역별 큰 키인 사람 구하기
 - select name, max(height), addr from usertbl GROUP BY addr;
 
2) 각 지역별 큰 키들 중에서 평균을 구하기
 - with abc(name, height, addr)\
    AS (select name, max(height), addr from usertbl GROUP BY addr)\
    select avg(height) AS "각 지역별 큰키의 평균" from abc;

# chapter07 SQL고급

## 조인
1) usertbl의 정보와 buytbl의 정보를 결합하는 INNER JOIN을 가장 많이 씀
 
2) 기본 구문
  - use sqldb;\
    select * from buytbl\
	inner join usertbl...(buttbl 테이블과 usertbl 테이블을 조인한다)\
	on buytbl.userid= usertbl.userid;...(조인될 조건)
    
    
  - select buytbl.userid, name, prodName, addr, mobile1 +mobile2 AS "연락처" from buytbl\
	inner join usertbl\
    on buytbl.userid= usertbl.userid\
	-- where buytbl.userid = "kbs"\
    ORDER BY num;
    
3) 별칭 써주기
  -  select B.userid, name, prodName, addr, mobile1 +mobile2 AS "연락처" from buytbl\
      inner join usertbl B\
      on buytbl.userid= B.userid\
      where buytbl.userid = "kbs"\
      ORDER BY num;
      
  - select U.userid, name, prodName, addr, mobile1 +mobile2 AS "연락처" from buytbl B\
	inner join usertbl U\
    on B.userid= U.userid\
    where buytbl.userid = "kbs"\
    ORDER BY num;
    
  - 조인이 가능한것만 출력\
    select U.userid, name\
    from usertbl U\
    WHERE EXISTS (\
    SELECT * from buytbl B\
    WHERE U.userid = B.userID);

## 프로젝트 팀 정하기

In [92]:
import random
student=["사랑이","마우스","볼펜","책상","물티슈","물병","나라","노트북","한혜찐","노영심"]

random.shuffle(student)
list_student=[]
while student:
    if len(student)>=2:
        student1=student.pop(random.randint(0,len(student)-1))
        student2=student.pop(random.randint(0,len(student)-1))
        list_student.append((student1, student2))
    else:
        student1=student.pop(random.randint(0,len(student)-1))
        student2=""
        list_student.append((student1, student2))
    
count=1
for i in list_student:
    print("{}팀 {}".format(count, i))
    count+=1

1팀 ('마우스', '책상')
2팀 ('한혜찐', '볼펜')
3팀 ('노트북', '나라')
4팀 ('사랑이', '물티슈')
5팀 ('물병', '노영심')

## python을 활용하여 SQL에 데이터 입력

In [13]:
import pymysql

conn, cur =None, None
data1, data2, data3, data4, data5, data6,data7, data8 = "","","","","","","",""
sql=""

conn=pymysql.connect(host="127.0.0.1", user="root",password="hp_8_8", db="sqldb", charset="utf8")
cur = conn.cursor()

while True:
    data1=input("사용자 ID를 입력하세요 :")
    if data1=="":
        break
    data2=input("이름을 입력하세요 :")
    data3=input("생일연도를 입력하세요 :")
    data4=input("addr을 입력하세요 :")
    data5=input("mobile01입력하세요 :")
    data6=input("mobile02입력하세요 :")
    data7=input("키를 입력하세요 :")
    data8 = input("생년월일을 입력하세요")
    print(data8)
    sql = "INSERT INTO usertbl VALUES ('"+data1+"','"+data2+"',"+data3+",'"+data4+"','"+data5+"','"+data6+"',"+data7+",'"+data8+"')"
    print(sql)
    cur.execute(sql)
    print(sql)
conn.commit()
print("완료")
conn.close()

사용자 ID를 입력하세요 :jkl
이름을 입력하세요 :정길리
생일연도를 입력하세요 :1998
addr을 입력하세요 :경북
mobile01입력하세요 :02
mobile02입력하세요 :2365
키를 입력하세요 :165
생년월일을 입력하세요1998-10-05
1998-10-05
INSERT INTO usertbl VALUES ('jkl','정길리',1998,'경북','02','2365',165,'1998-10-05')
INSERT INTO usertbl VALUES ('jkl','정길리',1998,'경북','02','2365',165,'1998-10-05')
사용자 ID를 입력하세요 :
완료

In [7]:
import pymysql

conn, cur =None, None
data1, data2, data3, data4 = "","","",""
row=None

conn=pymysql.connect(host="127.0.0.1", user="root",password="hp_8_8", db="sqldb", charset="utf8")
cur = conn.cursor()

cur.execute("select * from usertbl")
while True:
    row=cur.fetchone()
    if row==None:
        break
    data1=row[0]
    data2=row[1]
    data3=row[2]
    data4=row[3]
    data5=row[4]
    data6=row[5]
    data7=row[6]
    data8=row[7]
    print(data1,data2,data3,data4,data5,data6,data7,data8)
    
conn.commit()
conn.close()

BBK 바비킴 1973 서울 010 000000 176 2013-05-05
EJW 은지원 1972 경북 011 888888 174 2014-03-03
JKW 조관우 1965 경기 018 999999 172 2010-10-10
JYP 조용필 1950 경기 011 444444 166 2009-04-04
KBS 김범수 1979 경남 011 222222 173 2012-04-04
KKH 김경호 1971 전남 019 333333 177 2007-07-07
LJB 임재범 1963 서울 016 666666 182 2009-09-09
LSG 이승기 1987 서울 011 111111 182 2008-08-08
SSK 성시경 1979 서울 None None 186 2013-12-12
YJS 윤종신 1969 경남 None None 170 2005-05-05